Autodesk.Revit.DB.IExternalResourceServerInternalProxy.RootBelongsToServer(System.String)
Returns true if the path root belongs to the server.
rootName:
The path root to be tested.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.HasCustomServerNameForSessionPath
Implement this method to specify if the server has custom server name for session path (something other than GetShortName()).
Remarks:
Return true if the server name specified in GetInSessionPath() is different from GetShortName().
Returns:
Return true if the server name specified in GetInSessionPath() is different from GetShortName().
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.SupportBatchLoad
Implement this method to indicate whether this sever can do a batch load for multiple resources.
Remarks:
Some external servers, e.g. AutodeskDrive Server, can do a batch load for multiple resources.
Returns:
True if this sever can do a batch load for multiple resources.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.PreProcessResources(System.Collections.Generic.IList{Autodesk.Revit.DB.ExternalResourceLoadData})
Pre-processes resources by the server which will downloads the files from A360, if necessary.
loadData:
The data returned by the server as a result of this load operation.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.GetCacheRoot
Get the root location for locally cached files used
by this server.
Return "" if there is no local cache or if there is no
one root location.
Returns:
The local cache root for this server, or the empty
string if there is no local cache.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.IsHiddenInUI
Implement this method to indicate whether this sever is hidden in the user interface,
e.g. through External Resource icon.
Returns:
True if this sever is hidden in the user interface; false otherwise.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.GetUpdatedResourceDataForWorksharing(Autodesk.Revit.DB.ExternalResourceReference)
Implement this method to update the resource when attempting to save to workshared file.
Remarks:
Will be called when attempting to save to workshared file only if resourceNeedsUpdateForWorksharing() returned true.
resource:
The resource to update.
Returns:
Updated resource or failure definition id.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.ResourceNeedsUpdateForWorksharing(Autodesk.Revit.DB.ExternalResourceReference)
Implement this method to indicate whether a given resource needs an update to be shared by multiple users.
Remarks:
If true updateResourceForWorksharing() will be called.
resource:
The resource to check.
Returns:
True if the resource needs to be updated for worksharing.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.GetFullPathFromJournalPath(System.String)
Implement this method to convert a given URI path (if applicable) to the cache path on disk.
Remarks:
This function is called for the case only a URI path is known.
displayPath:
The URI path to the resource.
Returns:
The cache path converted with the given URI path.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.GetExternalResourceReferenceFromLocalPath(System.String,Autodesk.Revit.DB.ExternalResourceType)
Implement this method to convert a given path on disk (if applicable) to an ExternalResourceReference.
Remarks:
This funcion is called only if canHandleLocalPath() returns true.
If the given local path cannot be handled by this server, null ExternalResourceReference
will be returned.
fullPath:
The full path to the file.
resourceType:
The external resource type should be matched by the full path.
Returns:
The ExternalResourceReference converted with the given path.
Since:
2018

Autodesk.Revit.DB.IExternalResourceServerInternalProxy.CanHandleLocalPath(System.String,Autodesk.Revit.DB.ExternalResourceType,System.Boolean)
Implement this method to indicate whether this sever can handle a given local path,
which matches a given external resource type, if necessary.
Remarks:
A server cannot handle a given local path, such as getExternalResourceReferenceFromLocalPath()
if the given local path is outside of its cached path or the given one is invalid.
fullPath:
The full path to the file.
resourceType:
The external resource type should be matched by the full path.
isForFileOpen:
True if the operation is for Opening file; false if the operation is for linking.
Returns:
True if the server can handle a given local path; false otherwise.
Since:
2018